// Дано число больше 9. Вывести на экран  вторую цифру числа с конца
/*
int a = new Random().Next(10, 199);
System.Console.WriteLine(a);
int digitIndex = 1; // индекс нужной цифры
System.Console.WriteLine(a.ToString()[digitIndex] - '0');
*/