// Вывести на экран числа от -N до N
int i=-20;
int N = 20;
while(i<=N)
{
    Console.Write($"{i} ");
    i=i+1;
}




